In [2]:
#Imported required Libraries
import numpy as np 
import pandas as pd

In [12]:
#Loading the dataset into pandas dataframe
missing_values = ["Na", "na"] 
df=pd.read_csv("StudentsPerformance.csv", na_values = missing_values)

In [7]:
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [8]:
#Checking Null Values 
df.isnull().sum()

gender                         0
race/ethnicity                 0
parental level of education    0
lunch                          0
test preparation course        0
math score                     0
reading score                  0
writing score                  0
dtype: int64

In [13]:
df.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [15]:
#dimensions of the data frame
#shape attribute returns a two-item tuple of the number of rows and the number of columns in the DataFrame. 
df.shape

(1000, 8)

In [16]:
# total number of elements in the DataFrame or Series, use the size attribute.
df.size

8000

In [19]:
#o get the number of rows of a DataFrame or get the length of a Series, use the len function.
len(df)

1000

In [21]:
#count method can be used to return the number of non-missing values for each column/row of the DataFrame.
df.count()

gender                         1000
race/ethnicity                 1000
parental level of education    1000
lunch                          1000
test preparation course        1000
math score                     1000
reading score                  1000
writing score                  1000
dtype: int64

In [9]:
#Summarising the Datatypes 
df.dtypes

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object

In [10]:
#Turning Categorical Variables into Numerical Values

df['gender'].replace(to_replace='female', value=1, inplace = True) 
df['gender'].replace(to_replace='male', value=2, inplace = True)

In [11]:
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,1,group B,bachelor's degree,standard,none,72,72,74
1,1,group C,some college,standard,completed,69,90,88
2,1,group B,master's degree,standard,none,90,95,93
3,2,group A,associate's degree,free/reduced,none,47,57,44
4,2,group C,some college,standard,none,76,78,75